      ******************************************************************
      * AUTHOR: gomenas@pdx.edu
      * DATE: 4/26/21
      * PURPOSE:
      * TECTONICS: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGNMENT2.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT COURSES-UNSORTED ASSIGN TO "COURSES.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT COURSES-SORTED ASSIGN TO "COURSES-SORTED.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.
           
           SELECT SORT-FILE ASSIGN TO "WORK.TMP".
       DATA DIVISION.
       FILE SECTION.
           FD COURSES-UNSORTED.
        *>    206 IS LINE LENGTH OF ROW IN COURSES.TXT
       01 UNSORTED-RECORD PIC X(206).
       FD COURSES-SORTED.
       01 CLASS-REGISTRATION-RECORD.
           03 DEPT PIC X(6).
           03 COURSE-PREFIX PIC 9.
           03 FILLER PIC X(98).
           03 INSTR-EMAIL PIC X(16).
           03 FILLER PIC X(16).
           03 SCH PIC X(3).
           03 FILLER PIC X(65).
       SD SORT-FILE.
       01 SORTED-RECORD.
           03 FILLER PIC X(105).
           03 INSTRUCTOR-EMAIL PIC X(16).
           03 FILLER PIC X(83).

       WORKING-STORAGE SECTION.
       77  SCH-COMP PIC 9(3).
       77  COURSE-TUITION PIC 9(5)V99 VALUE IS ZERO.
       77  COLLEGE-TOTAL PIC 9(9)V99 VALUE IS ZERO.
       77  INSTRUCTOR-TOTAL PIC 9(5)V99 VALUE IS ZERO.
       77  INSTRUCTOR-SCH-TOTAL PIC 9(5)V99 VALUE IS ZERO.
       77  SCH-TOTAL PIC 9(5)V99 VALUE IS ZERO.
       77  FILE-STAUS PIC 9 VALUE IS 0.
            88 END-OF-FILE VALUE IS 1.
       77  LAST-INSTR PIC X(16).

       01 OUTPUT-LINE.
           03 INSTRUCTOR-IDENT PIC X(25).
           03 FILLER PIC X(4).
           03 SCH-DISPLAY PIC ZZZ,ZZ9.
           03 FILLER PIC X(4).
           03 TUITION-TOTAL PIC $$$,$$$,$$9.99.
       
       01 PRE-OUTPUT.
           03 HEADING-1 PIC X(25) VALUE IS "INSTRUCTOR".
           03 FILLER PIC X(4).
           03 HEADING-2 PIC X(10) VALUE IS "TOTAL SCH".
           03 FILLER PIC X(4).
           03 HEADING-3 PIC X(14) VALUE IS "TUITION TOTAL".
       
       01 PRE-OUTPUT-FOOTER.
           03 HEADING-1 PIC X(25) VALUE IS "-----------".
           03 FILLER PIC X(4).
           03 HEADING-2 PIC X(10) VALUE IS "---------".
           03 FILLER PIC X(4).
           03 HEADING-3 PIC X(14) VALUE IS "-------------".

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM INITIALIZE-IT.
           DISPLAY "==================================================="
               "===============".
           DISPLAY PRE-OUTPUT.
           DISPLAY PRE-OUTPUT-FOOTER.
           PERFORM PROCESS-FILE.
           PERFORM CLEAN-UP.
           STOP RUN.

       INITIALIZE-IT.
           SORT SORT-FILE ON ASCENDING KEY INSTRUCTOR-EMAIL
               USING COURSES-UNSORTED
               GIVING COURSES-SORTED.
           OPEN INPUT COURSES-SORTED.
           READ COURSES-SORTED.

       PROCESS-FILE.
           READ COURSES-SORTED AT END MOVE 1 TO FILE-STAUS.
           MOVE INSTR-EMAIL TO LAST-INSTR.
           PERFORM PROCESS-RECORDS UNTIL END-OF-FILE.
           PERFORM FINAL-DISPLAY.
               
       PROCESS-RECORDS.
           MOVE SCH TO SCH-COMP.
           IF COURSE-PREFIX IS LESS THAN 5
               MULTIPLY SCH-COMP BY 238.85 GIVING COURSE-TUITION
           ELSE
               MULTIPLY SCH-COMP BY 496.50 GIVING COURSE-TUITION.

           ADD SCH-COMP TO SCH-TOTAL.
           ADD SCH-COMP TO INSTRUCTOR-SCH-TOTAL.
           ADD COURSE-TUITION TO COLLEGE-TOTAL.
           ADD COURSE-TUITION TO INSTRUCTOR-TOTAL.

           READ COURSES-SORTED AT END MOVE 1 TO FILE-STAUS
               PERFORM DETAILED-DISPLAY.

           IF INSTR-EMAIL NOT EQUAL LAST-INSTR
               PERFORM DETAILED-DISPLAY.

       DETAILED-DISPLAY.
           MOVE SCH-TOTAL TO SCH-DISPLAY.
           MOVE LAST-INSTR TO INSTRUCTOR-IDENT.
           MOVE INSTRUCTOR-TOTAL TO TUITION-TOTAL.
           DISPLAY OUTPUT-LINE.

           MOVE INSTR-EMAIL TO LAST-INSTR.
           MOVE ZERO TO INSTRUCTOR-TOTAL.
           MOVE ZERO TO SCH-TOTAL.

       FINAL-DISPLAY.
           MOVE "COLLEGE OF ENGINEERING" TO INSTRUCTOR-IDENT.
           MOVE INSTRUCTOR-SCH-TOTAL TO SCH-DISPLAY.
           MOVE COLLEGE-TOTAL TO TUITION-TOTAL.

           DISPLAY " ".
           DISPLAY OUTPUT-LINE.
           DISPLAY "==================================================="
               "===============".

       CLEAN-UP.
           CLOSE COURSES-SORTED.
       END PROGRAM ASSIGNMENT2.
